tasogarenokagi/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Featherlight (Native USB Port)
# ---------------------------------------
featherlight_native.name=Featherlight (Native USB Port)
featherlight_native.vid.0=0x1209
featherlight_native.pid.0=0x0001
featherlight_native.upload.tool=bossac
featherlight_native.upload.protocol=sam-ba
featherlight_native.upload.maximum_size=262144
featherlight_native.upload.use_1200bps_touch=true
featherlight_native.upload.wait_for_upload_port=true
featherlight_native.upload.native_usb=true
featherlight_native.build.mcu=cortex-m0plus
featherlight_native.build.f_cpu=48000000L
featherlight_native.build.usb_product="Featherlight"
featherlight_native.build.usb_manufacturer="Twilight Circuits"
featherlight_native.build.board=SAMD_FEATHERLIGHT
featherlight_native.build.core=arduino
featherlight_native.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
featherlight_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
featherlight_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
featherlight_native.build.variant=featherlight
featherlight_native.build.variant_system_lib=
featherlight_native.build.vid=0x2341
featherlight_native.build.pid=0x804d
featherlight_native.bootloader.tool=openocd
featherlight_native.bootloader.file=featherlight/samd21_sam_ba_featherlight.bin
